blog.org
#+TITLE:     技術部落格經營筆記
#+AUTHOR:    fatfingererr - www.ffe.tw
#+EMAIL:     (concat "fatfingererr" at-sign "gmail.com")
#+DATE:      2017-02-08
#+LANGUAGE:  zh-TW
#+OPTIONS:   H:4 num:nil toc:2
#+SETUPFILE: theme-readtheorg.setup

#+begin_EXPORT html
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
<a href="https://www.ffe.tw/series.html" class="fa fa-home"> Blog</a>&nbsp;&nbsp;|&nbsp;&nbsp;
<a href="https://github.com/fatfingererr/note/blob/master/blog.org" class="fa fa-github"> GitHub</a>
</div>
#+end_EXPORT

-----
* 制定計畫的步驟

　一直以來就想要認真的寫部落格，但是都始終沒有養成習慣。直到我在去年 (2016) 看到了一篇文章^1才知道以前看到很多的部落格，是所謂的「技術部落格」，也就是部落格是面向那些尋找技術資訊的工程師或專家。而技術部落格中可以有系統的去規劃怎麼經營，因此我想以該篇文章的架構來設計一個自己的寫作計畫底下多數是由參考資料整理而得，就不再標示引用。

　一個好的技術部落格應掌握底下三點：

1. 清楚部落格的流量來源
2. 掌握不同文章類型的寫作要點
3. 規劃文章內容與架構
4. 收集寫作的靈感

** 流量來源

　要探討流量來源，基本上要先進行：

- [ ] 首先將技術文章進行分類
- [ ] 評估在這個分類上需要保持的寫作頻率
- [ ] 衡量寫該類型的文章所需要的時間

*** 技術文章的分類

| 文章分類 | 寫作頻率  | 所需時間   | 連結來源           | 產生結果 |
|----------+-----------+------------+--------------------+----------|
| 技術細節 | 每天N次   | 15-3 0分鐘 | 搜尋引擎           | 流量     |
| 乾貨     | 每月N次   | 1-2 小時   | 搜尋引擎／平台群組 | 流量     |
| 實踐總結 | 每周1-2次 | 2 小時     | 平台群組           | 流量     |
| 雞湯雜談 | 每季N次   | 不一定     | 平台群組／社群媒體 | 評論     |

　根據文章分類，我們就可以回推部落格流量的可能來源，也可以知道可能產生的結果。

** 文章分類

*** 分類一：技術細節

- 技術細節是希望讓其他技術人員透過搜尋引擎用你想要的關鍵字搜尋到。
  - 因此可以用前半段為術語或關鍵字，後半段為指向意圖的標題來寫文章。
- 對於尚未出名或擁有光環之前，這類文章會是主要的流量來源。
- 這種文章的材料是源自於日常工作遇到的各種技術問題，例如：
  - 第三方套件的更新
  - 對各種新技術進行的嘗試
  - 運行環境或更新版本造成的Bug
- 寫作之前可以先用關鍵字搜尋是否有類似文章，有又是高手寫的那就不要重複。
- 如果你打算開始寫，那要多注意幾點：
  - 技術的細節表達需要過濾，不要什麼都打很細，但也不要關鍵步驟不說明。
  - 站在一個學習者的角度寫下一步步的思考流程。
  - 和技術文件不同，可以放入一些個人主觀意見或情緒。
  - 最終回頭檢視整篇文章，是否達到簡潔明瞭，因為文章面對的是搜尋資訊的人。
- 如果沒有類似文章然後你寫了一篇，也可能出現文章被剽竊的情況，因此也可以在一段時間後進行檢舉。

*** 分類二：乾貨

- 乾貨類型的文章通常是作者對於某項事物的一個總結，且具有收藏價值。
- 乾貨文章通常都會以目標讀者搭配讀者需求做標題（例如：OO要掌握的N條守則），因此也相對容易傳播。
- 由於寫作難度較高，所以倚賴於作者本身的學習經驗，因此不是一兩天就能搞定，可能可以分成三天共兩小時來完成。

*** 分類三：實踐總結

- 實踐總結的文章主要是以系列的方式呈現，目標是期盼能在未來衍生成書籍或指南
- 大部分是技術細節和乾貨分別在某個主題上累積到一個量，在整合起來做更深入的技術討論
- 會更傾向於程式碼、運行細節而非理論。

*** 分類四：雞湯雜談

- 雞湯雜談主要就是開地圖砲與假大空作為標題，沒有技術含量，但是會建構論述或呈現某種理論思想。
- 通常要作者本身達到一個技術水平，寫出來才會有人支持與分享，也往往不會限定某個領域，目標讀者的範圍廣。
- 這類的文章更倚賴在平台或媒體中的傳播，因為多數情況不會有人搜尋這種類型的文章。

** 內容架構

　對於技術部落格，有幾點很重要：

- 標題與小標題，好的標題能帶來流量。
- 內容應盡量以實務為主，而非漫談理論，最好有搭配的程式碼範例且放在GitHub或Gist。
- 多一些圖片，越多圖片能讓文章更顯得活潑而不會枯燥乏味。
- 排版要盡量容易閱讀。

** 靈感蒐集

- 如果要能從寫作材料中吸取營養，最後長成一篇好的文章，靈感蒐集與處理的步驟就很重要。
- 一篇文章的生命週期是：
  - 論點：有一個想分享的概念 → 論據：找到支持論點的依據 → 文章：整理成有系統的論述
- 平時要利用「廢時」來快速記下靈感，可以透過APP隨身進行記錄。

* 參考資料
**** 1. [[http://blog.csdn.net/phodal/article/details/50769309][程序员如何才能写出一篇好的技术文章 - Phodal's zenthink - 博客频道 - CSDN.NET]]


