docs/blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-TW" xml:lang="zh-TW">
<head>
<!-- 2017-02-08 Wed 22:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>技術部落格經營筆記</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fatfingererr - www.ffe.tw" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">技術部落格經營筆記</h1>
<div id="table-of-contents">
<h2>&#30446;&#37636;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org13be3d9">制定計畫的步驟</a>
<ul>
<li><a href="#orgd31d19d">流量來源</a></li>
<li><a href="#orgd786efc">文章分類</a></li>
<li><a href="#org9cc3ecf">內容架構</a></li>
<li><a href="#orgfb92847">靈感蒐集</a></li>
</ul>
</li>
<li><a href="#org44e5186">參考資料</a></li>
</ul>
</div>
</div>
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
<a href="https://www.ffe.tw/series.html" class="fa fa-home"> Blog</a>　|　
<a href="https://github.com/fatfingererr/note/blob/master/blog.org" class="fa fa-github"> GitHub</a>
</div>

<hr  />
<div id="outline-container-org13be3d9" class="outline-2">
<h2 id="org13be3d9">制定計畫的步驟</h2>
<div class="outline-text-2" id="text-org13be3d9">
<p>
　一直以來就想要認真的寫部落格，但是都始終沒有養成習慣。直到我在去年 (2016) 看到了一篇文章<sup>1才知道以前看到很多的部落格</sup>，是所謂的「技術部落格」，也就是部落格是面向那些尋找技術資訊的工程師或專家。而技術部落格中可以有系統的去規劃怎麼經營，因此我想以該篇文章的架構來設計一個自己的寫作計畫底下多數是由參考資料整理而得，就不再標示引用。
</p>

<p>
　一個好的技術部落格應掌握底下三點：
</p>

<ol class="org-ol">
<li>清楚部落格的流量來源</li>
<li>掌握不同文章類型的寫作要點</li>
<li>規劃文章內容與架構</li>
<li>收集寫作的靈感</li>
</ol>
</div>

<div id="outline-container-orgd31d19d" class="outline-3">
<h3 id="orgd31d19d">流量來源</h3>
<div class="outline-text-3" id="text-orgd31d19d">
<p>
　要探討流量來源，基本上要先進行：
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 首先將技術文章進行分類</li>
<li class="off"><code>[&#xa0;]</code> 評估在這個分類上需要保持的寫作頻率</li>
<li class="off"><code>[&#xa0;]</code> 衡量寫該類型的文章所需要的時間</li>
</ul>
</div>

<div id="outline-container-org68c0e24" class="outline-4">
<h4 id="org68c0e24">技術文章的分類</h4>
<div class="outline-text-4" id="text-org68c0e24">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文章分類</th>
<th scope="col" class="org-left">寫作頻率</th>
<th scope="col" class="org-left">所需時間</th>
<th scope="col" class="org-left">連結來源</th>
<th scope="col" class="org-left">產生結果</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">技術細節</td>
<td class="org-left">每天N次</td>
<td class="org-left">15-3 0分鐘</td>
<td class="org-left">搜尋引擎</td>
<td class="org-left">流量</td>
</tr>

<tr>
<td class="org-left">乾貨</td>
<td class="org-left">每月N次</td>
<td class="org-left">1-2 小時</td>
<td class="org-left">搜尋引擎／平台群組</td>
<td class="org-left">流量</td>
</tr>

<tr>
<td class="org-left">實踐總結</td>
<td class="org-left">每周1-2次</td>
<td class="org-left">2 小時</td>
<td class="org-left">平台群組</td>
<td class="org-left">流量</td>
</tr>

<tr>
<td class="org-left">雞湯雜談</td>
<td class="org-left">每季N次</td>
<td class="org-left">不一定</td>
<td class="org-left">平台群組／社群媒體</td>
<td class="org-left">評論</td>
</tr>
</tbody>
</table>

<p>
　根據文章分類，我們就可以回推部落格流量的可能來源，也可以知道可能產生的結果。
</p>
</div>
</div>
</div>

<div id="outline-container-orgd786efc" class="outline-3">
<h3 id="orgd786efc">文章分類</h3>
<div class="outline-text-3" id="text-orgd786efc">
</div><div id="outline-container-org303d7e1" class="outline-4">
<h4 id="org303d7e1">分類一：技術細節</h4>
<div class="outline-text-4" id="text-org303d7e1">
<ul class="org-ul">
<li>技術細節是希望讓其他技術人員透過搜尋引擎用你想要的關鍵字搜尋到。
<ul class="org-ul">
<li>因此可以用前半段為術語或關鍵字，後半段為指向意圖的標題來寫文章。</li>
</ul></li>
<li>對於尚未出名或擁有光環之前，這類文章會是主要的流量來源。</li>
<li>這種文章的材料是源自於日常工作遇到的各種技術問題，例如：
<ul class="org-ul">
<li>第三方套件的更新</li>
<li>對各種新技術進行的嘗試</li>
<li>運行環境或更新版本造成的Bug</li>
</ul></li>
<li>寫作之前可以先用關鍵字搜尋是否有類似文章，有又是高手寫的那就不要重複。</li>
<li>如果你打算開始寫，那要多注意幾點：
<ul class="org-ul">
<li>技術的細節表達需要過濾，不要什麼都打很細，但也不要關鍵步驟不說明。</li>
<li>站在一個學習者的角度寫下一步步的思考流程。</li>
<li>和技術文件不同，可以放入一些個人主觀意見或情緒。</li>
<li>最終回頭檢視整篇文章，是否達到簡潔明瞭，因為文章面對的是搜尋資訊的人。</li>
</ul></li>
<li>如果沒有類似文章然後你寫了一篇，也可能出現文章被剽竊的情況，因此也可以在一段時間後進行檢舉。</li>
</ul>
</div>
</div>

<div id="outline-container-org94ecfd5" class="outline-4">
<h4 id="org94ecfd5">分類二：乾貨</h4>
<div class="outline-text-4" id="text-org94ecfd5">
<ul class="org-ul">
<li>乾貨類型的文章通常是作者對於某項事物的一個總結，且具有收藏價值。</li>
<li>乾貨文章通常都會以目標讀者搭配讀者需求做標題（例如：OO要掌握的N條守則），因此也相對容易傳播。</li>
<li>由於寫作難度較高，所以倚賴於作者本身的學習經驗，因此不是一兩天就能搞定，可能可以分成三天共兩小時來完成。</li>
</ul>
</div>
</div>

<div id="outline-container-org0524bcf" class="outline-4">
<h4 id="org0524bcf">分類三：實踐總結</h4>
<div class="outline-text-4" id="text-org0524bcf">
<ul class="org-ul">
<li>實踐總結的文章主要是以系列的方式呈現，目標是期盼能在未來衍生成書籍或指南</li>
<li>大部分是技術細節和乾貨分別在某個主題上累積到一個量，在整合起來做更深入的技術討論</li>
<li>會更傾向於程式碼、運行細節而非理論。</li>
</ul>
</div>
</div>

<div id="outline-container-org539425f" class="outline-4">
<h4 id="org539425f">分類四：雞湯雜談</h4>
<div class="outline-text-4" id="text-org539425f">
<ul class="org-ul">
<li>雞湯雜談主要就是開地圖砲與假大空作為標題，沒有技術含量，但是會建構論述或呈現某種理論思想。</li>
<li>通常要作者本身達到一個技術水平，寫出來才會有人支持與分享，也往往不會限定某個領域，目標讀者的範圍廣。</li>
<li>這類的文章更倚賴在平台或媒體中的傳播，因為多數情況不會有人搜尋這種類型的文章。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9cc3ecf" class="outline-3">
<h3 id="org9cc3ecf">內容架構</h3>
<div class="outline-text-3" id="text-org9cc3ecf">
<p>
　對於技術部落格，有幾點很重要：
</p>

<ul class="org-ul">
<li>標題與小標題，好的標題能帶來流量。</li>
<li>內容應盡量以實務為主，而非漫談理論，最好有搭配的程式碼範例且放在GitHub或Gist。</li>
<li>多一些圖片，越多圖片能讓文章更顯得活潑而不會枯燥乏味。</li>
<li>排版要盡量容易閱讀。</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb92847" class="outline-3">
<h3 id="orgfb92847">靈感蒐集</h3>
<div class="outline-text-3" id="text-orgfb92847">
<ul class="org-ul">
<li>如果要能從寫作材料中吸取營養，最後長成一篇好的文章，靈感蒐集與處理的步驟就很重要。</li>
<li>一篇文章的生命週期是：
<ul class="org-ul">
<li>論點：有一個想分享的概念 → 論據：找到支持論點的依據 → 文章：整理成有系統的論述</li>
</ul></li>
<li>平時要利用「廢時」來快速記下靈感，可以透過APP隨身進行記錄。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org44e5186" class="outline-2">
<h2 id="org44e5186">參考資料</h2>
<div class="outline-text-2" id="text-org44e5186">
</div><div id="outline-container-org11b08f4" class="outline-5">
<h5 id="org11b08f4">1. <a href="http://blog.csdn.net/phodal/article/details/50769309">程序员如何才能写出一篇好的技术文章 - Phodal's zenthink - 博客频道 - CSDN.NET</a></h5>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2017-02-08</p>
<p class="author">&#20316;&#32773;: fatfingererr - www.ffe.tw</p>
<p class="date">Created: 2017-02-08 Wed 22:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
